Autodesk.Revit.DB.Architecture.RoomFilter.#ctor
Constructs a filter which matches only rooms.

Autodesk.Revit.DB.Architecture.RoomFilter
A filter used to match rooms.
Remarks:
This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements
before the elements are obtained and expanded. Therefore this filter does not have to be
paired with another quick filter to minimize the number of Elements that are expanded.